sebnor31/MagAlarm/Firmware/CC2510_TX/include/ioCCCxx10_bitdef.h
// T4CC0 (0xED) - Timer 4 Channel 0 Compare Value

// T4CCTL1 (0xEE) - Timer 4 Channel 1 Compare Control
#define T4CCTL1_IM                        0x40
#define T4CCTL1_CMP                       0x38
#define T4CCTL1_CMP0                      0x08
#define T4CCTL1_CMP1                      0x10
#define T4CCTL1_CMP2                      0x20
#define T4CCTL1_MODE                      0x04

#define T4CCTL1_SET_ON_CMP                (0x00 << 3)
#define T4CCTL1_CLR_ON_CMP                (0x01 << 3)
#define T4CCTL1_TOG_ON_CMP                (0x02 << 3)
#define T4CCTL1_SET_CMP_UP_CLR_0          (0x03 << 3)
#define T4CCTL1_CLR_CMP_UP_SET_0          (0x04 << 3)
#define T4CCTL1_SET_CMP_CLR_C0            (0x05 << 3)
#define T4CCTL1_CLR_CMP_SET_C0            (0x06 << 3)


// TIMIF (0xD8) - Timers 1/3/4 Interrupt Mask/Flag - bit accessible SFR register


/*******************************************************************************
 * ADC
 */

// ADCL (0xBA) - ADC Data Low (only bit 7-4 used)

// ADCH (0xBB) - ADC Data High

// ADCCON1 (0xB4) - ADC Control 1
#define ADCCON1_EOC                       0x80
#define ADCCON1_ST                        0x40
#define ADCCON1_STSEL                     0x30
#define ADCCON1_STSEL0                    0x10
#define ADCCON1_STSEL1                    0x20
#define ADCCON1_RCTRL                     0x0C
#define ADCCON1_RCTRL0                    0x04
#define ADCCON1_RCTRL1                    0x08

#define STSEL_P2_0                        (0x00 << 4)
#define STSEL_FULL_SPEED                  (0x01 << 4)
#define STSEL_T1C0_CMP_EVT                (0x02 << 4)
#define STSEL_ST                          (0x03 << 4)

#define ADCCON1_RCTRL_COMPL               (0x00 << 2)
#define ADCCON1_RCTRL_LFSR13              (0x01 << 2)



// ADCCON2 (0xB5) - ADC Control 2
#define ADCCON2_SREF                      0xC0
#define ADCCON2_SREF0                     0x40
#define ADCCON2_SREF1                     0x80
#define ADCCON2_SDIV                      0x30
#define ADCCON2_SDIV0                     0x10
#define ADCCON2_SDIV1                     0x20
#define ADCCON2_SCH                       0x0F
#define ADCCON2_SCH0                      0x01
#define ADCCON2_SCH1                      0x02
#define ADCCON2_SCH2                      0x04
#define ADCCON2_SCH3                      0x08

#define ADCCON2_SREF_1_25V                (0x00 << 6)
#define ADCCON2_SREF_P0_7                 (0x01 << 6)
#define ADCCON2_SREF_AVDD                 (0x02 << 6)
#define ADCCON2_SREF_P0_6_P0_7            (0x03 << 6)

#define ADCCON2_SDIV_64                   (0x00 << 4)
#define ADCCON2_SDIV_128                  (0x01 << 4)
#define ADCCON2_SDIV_256                  (0x02 << 4)
#define ADCCON2_SDIV_512                  (0x03 << 4)

#define ADCCON2_SCH_AIN0                  (0x00)
#define ADCCON2_SCH_AIN1                  (0x01)
#define ADCCON2_SCH_AIN2                  (0x02)
#define ADCCON2_SCH_AIN3                  (0x03)
#define ADCCON2_SCH_AIN4                  (0x04)
#define ADCCON2_SCH_AIN5                  (0x05)
#define ADCCON2_SCH_AIN6                  (0x06)
#define ADCCON2_SCH_AIN7                  (0x07)
#define ADCCON2_SCH_AIN0_1                (0x08)
#define ADCCON2_SCH_AIN2_3                (0x09)
#define ADCCON2_SCH_AIN4_5                (0x0A)
#define ADCCON2_SCH_AIN6_7                (0x0B)
#define ADCCON2_SCH_GND                   (0x0C)
#define ADCCON2_SCH_POSVOL                (0x0D)
#define ADCCON2_SCH_TEMPR                 (0x0E)
#define ADCCON2_SCH_VDD_3                 (0x0F)


// ADCCON3 (0xB6) - ADC Control 3
#define ADCCON3_EREF                      0xC0
#define ADCCON3_EREF0                     0x40
#define ADCCON3_EREF1                     0x80
#define ADCCON3_EDIV                      0x30
#define ADCCON3_EDIV0                     0x10
#define ADCCON3_EDIV1                     0x20
#define ADCCON2_ECH                       0x0F
#define ADCCON2_ECH0                      0x01
#define ADCCON2_ECH1                      0x02
#define ADCCON2_ECH2                      0x04
#define ADCCON2_ECH3                      0x08

#define ADCCON3_EREF_1_25V                (0x00 << 6)
#define ADCCON3_EREF_P0_7                 (0x01 << 6)
#define ADCCON3_EREF_AVDD                 (0x02 << 6)
#define ADCCON3_EREF_P0_6_P0_7            (0x03 << 6)

#define ADCCON3_EDIV_64                   (0x00 << 4)
#define ADCCON3_EDIV_128                  (0x01 << 4)
#define ADCCON3_EDIV_256                  (0x02 << 4)
#define ADCCON3_EDIV_512                  (0x03 << 4)

#define ADCCON3_ECH_AIN0                  (0x00)
#define ADCCON3_ECH_AIN1                  (0x01)
#define ADCCON3_ECH_AIN2                  (0x02)
#define ADCCON3_ECH_AIN3                  (0x03)
#define ADCCON3_ECH_AIN4                  (0x04)
#define ADCCON3_ECH_AIN5                  (0x05)
#define ADCCON3_ECH_AIN6                  (0x06)
#define ADCCON3_ECH_AIN7                  (0x07)
#define ADCCON3_ECH_AIN0_1                (0x08)
#define ADCCON3_ECH_AIN2_3                (0x09)
#define ADCCON3_ECH_AIN4_5                (0x0A)
#define ADCCON3_ECH_AIN6_7                (0x0B)
#define ADCCON3_ECH_GND                   (0x0C)
#define ADCCON3_ECH_POSVOL                (0x0D)
#define ADCCON3_ECH_TEMPR                 (0x0E)
#define ADCCON3_ECH_VDD_3                 (0x0F)



/*******************************************************************************
 * Random Number Generator
 */

// RNDL (0xBC) - Random Number Generator Data Low Byte

// RNDH (0xBD) - Random Number Generator Data High Byte


/*******************************************************************************
 * AES
 */

// ENCCS (0xB3) - Encryption Control and Status
#define ENCCS_MODE                        0x70
#define ENCCS_MODE0                       0x10
#define ENCCS_MODE1                       0x20
#define ENCCS_MODE2                       0x40
#define ENCCS_RDY                         0x08
#define ENCCS_CMD                         0x06
#define ENCCS_CMD0                        0x02
#define ENCCS_CMD1                        0x04
#define ENCCS_ST                          0x01

#define ENCCS_MODE_CBC                    (0x00 << 4)
#define ENCCS_MODE_CFB                    (0x01 << 4)
#define ENCCS_MODE_OFB                    (0x02 << 4)
#define ENCCS_MODE_CTR                    (0x03 << 4)
#define ENCCS_MODE_ECB                    (0x04 << 4)
#define ENCCS_MODE_CBCMAC                 (0x05 << 4)

